function fnGetCollectDataEvalution(val) {
    const maintext  = [ // หัวข้อหลัก
        {id:101, text:"๑. สภาพแวดล้อมการควบคุม" , description:"สภาพแวดล้อมการควบคุมเป็นปัจจัยพื้นฐานในการดำเนินงานที่ส่งผลให้มีการนำการควบคุมภายในมาปฏิบัติในหน่วยงาน ฝ่ายบริหารและผู้บังคับบัญชาจะต้องสร้างบรรยากาศในทุกระดับ ตระหนักถึงความสำคัญของการควบคุมภายใน รวมทั้งการดำเนินงานที่คาดหวังได้ สภาพแวดล้อมการควบคุมเป็นพื้นฐานสำคัญที่จะส่งผลกระทบต่อองค์ประกอบของการควบคุมภายในอื่น ๆ"},
        {id:102, text:"๒. การประเมินความเสี่ยง" , description:"การประเมินความเสี่ยงเป็นกระบวนการที่ดำเนินการอย่างต่อเนื่องและเป็นประจำ เพื่อระบุและวิเคราะห์ความเสี่ยงที่มีผลกระทบต่อการบรรลุวัตถุประสงค์ของหน่วยงาน รวมถึงกำหนดวิธีการจัดการความเสี่ยงนั้น ฝ่ายบริหารควรคำนึงถึงการเปลี่ยนแปลงของสภาพแวดล้อมภายนอกและภารกิจภายในทั้งหมดที่มีผลต่อการบรรลุวัตถุประสงค์ของหน่วยงาน"},
        {id:103, text:"๓. กิจกรรมควบคุมความเสี่ยง", description:"กิจกรรมการควบคุมเป็นการปฏิบัติที่กำหนดไว้ในโยบายและกระบวนการดำเนินงาน เพื่อให้มั่นใจว่าจะลดหรือควบคุมความเสี่ยงให้สามารถบรรลุวัตถุประสงค์ กิจกรรมตวบตุมควรได้รับการนำไปปฏิบัติทั่วทุกระดับในหน่วยงานในกระบวนการปฏิบัติงานขั้นตอนการดำเนินงานต่าง ๆ รวมถึงการนำเทคโนโลยีม่ใช้ในการดำเนินงาน"},
        {id:104, text:"๔. สารสนเทศและการสื่อสาร", description:"สารสนเทศเป็นสิ่งจำเป็นสำหรับหน่วยงานที่จะช่วยให้มีการดำเนินการตามการควบคุมภายในที่กำหนด เพื่อสนับสนุนให้บรรลุวัตถุประสงค์ของหน่วยงาน การสื่อสารเกิดขึ้นได้ทั้งจากภายในและภายนอก และเป็นช่องทางเพื่อให้ทราบถึงสารสนเทศที่สำคัญในการควบคุมการดำเนินงานของหน่วยงาน การสื่อสารจะช่วยให้บุคลากรในหน่วยงานมีความเข้าใจถึงความรับผิดชอบและความสำคัญของการควบคุมภายในที่มีต่อการบรรลุวัตถุประสงค์"},
        {id:105, text:"๕. กิจกรรมการติดตามผล", description:"กิจกรรมการติดตามผลเป็นการประเมินผลระหว่างการปฏิบัติงาน การประเมินผลเป็นรายครั้ง หรือเป็นการประเมินผลทั้งสองวิธีร่วมกัน เพื่อให้เกิดความมั่นใจว่าได้มีการปฏิบัติตามหลักการ ในแต่ละองค์ประกอบของการควบคุมภายในทั้ง ๕ องค์ประกอบ กรณีที่ผลการประเมินการควบคุมภายในจะก่อให้เกิดความเสียหายต่อหน่วยงานให้รายงานต่อฝ่ายบริหารและผู้บังคับบัญชา อย่างทันเวลา"},
    ]

    const subtext = [ // หัวข้อย่อย
        {id:101, text:"๑.๑ หน่วยงานแสดงให้เห็นถึงการยึดมั่นในคุณค่าของความซื่อตรงและจริยธรรม", id_head: 101 }, 
        {id:102, text:"๑.๒ หน่วยงานแสดงให้เห็นถึงความเป็นอิสระจากฝ่ายบริหารและมีหน้าที่กำกับดูแลให้มีการพัฒนาหรือปรับปรุงการควบคุมภายใน รวมถึงการดำเนินการเกี่ยวกับการควบคุมภายใน", id_head: 101},
        {id:103, text:"๑.๓ หน่วยงานมีการจัดโครงสร้างองค์กร สายการบังคับบัญชา อำนาจหน้าที่และความรับผิดชอบที่เหมาะสมในการบรรลุวัตถุประสงค์ของหน่วยงาน", id_head: 101},
        {id:104, text:"๑.๔ หน่วยงานแสดงให้เห็นถึงความมุ่งมั่นในการสร้างแรงจูงใจ พัฒนาและรักษาบุคลากรที่มีความรู้ ความสามารถที่สอดคล้องกับวัตถุประสงค์ของหน่วยงาน", id_head: 101},
        {id:105, text:"๑.๕ หน่วยงานมีการกำหนดให้บุคลากรมีหน้าที่และความรับผิดชอบต่อผลการปฏิบัติงานตามระบบการควบคุมภายใน เพื่อบรรลุวัตถุประสงค์ของหน่วยงาน", id_head: 101},
        {id:106, text:"๒.๑ หน่วยงานระบุวัตถุประสงค์การควบคุมภายในของการปฏิบัติงานให้สอดคล้องกับวัตถุประสงค์ของหน่วยไว้อย่างชัดเจนและเพียงพอที่จะสามารถระบุและประเมินความเสี่ยงที่เกี่ยวข้องกับวัตถุประสงค์", id_head: 102},
        {id:107, text:"๒.๒ หน่วยงานมีการระบุความเสี่ยงที่มีผลต่อการบรรลุวัตถุประสงค์การควบคุมภายในอย่างครอบคลุมและวิเคราะห์ความเสี่ยง เพื่อกำหนดวิธีจัดการความเสี่ยงนั้น", id_head: 102},
        {id:108, text:"๒.๓ หน่วยงานมีการพิจารณาโอกาสที่อาจเกิดการทุจริต เพื่อประกอบการประเมินความเสี่ยงที่ส่งผลต่อการบรรลุวัตถุประสงค์", id_head: 102},
        {id:109, text:"๒.๔ หน่วยงานมีการระบุและประเมินการเปลี่ยนแปลงที่อาจมีผลกระทบอย่างมีนัยสำคัญต่อระบบการควบคุมภายใน", id_head: 102},
        {id:110, text:"๓.๑ หน่วยงานมีการระบุและพัฒนากิจกรรมการควบคุม เพื่อลดความเสี่ยงในการบรรลุวัตถุประสงค์ให้อยู่ในระดับที่ยอมรับได้", id_head: 103},
        {id:111, text:"๓.๒ หน่วยงานมีการระบุและพัฒนากิจกรรมการควบคุมทั่วไปด้านเทคโนโลยี เพื่อสนับสนุนการบรรลุวัตถุประสงค์", id_head: 103},
        {id:112, text:"๓.๓ หน่วยงานมีการจัดให้กิจกรรมการควบคุมโดยกำหนดไว้ในนโยบาย ประกอบด้วยผลสำเร็จที่คาดหวังและขั้นตอนการปฏิบัติงาน เพื่อนำนโยบายไปสู่การปฏิบัติจริง", id_head: 103},
        {id:113, text:"๔.๑ หน่วยงานมีการจัดทำหรือจัดหาและใช้สารสนเทศที่เกี่ยวข้องและมีคุณภาพ เพื่อสนับสนุนให้มีการปฏิบัติตามการควบคุมภายในที่กำหนด", id_head: 104},
        {id:114, text:"๔.๒ หน่วยงานมีการสื่อสารภายในที่เกี่ยวข้องกับสารสนเทศรวมถึงวัตถุประสงค์และความรับผิดชอบที่มีต่อการควบคุมภายใน ซึ่งมีความจำเป็นในการสนับสนุนให้มีการปฏิบัติตามการควบคุมภายในที่กำหนด", id_head: 104},
        {id:115, text:"๔.๓ หน่วยงานมีการสื่อสารกับบุคคลภายนอกเกี่ยวกับเรื่องที่มีผลกระทบต่อการปฏิบัติตามการควบคุมภายในที่กำหนด", id_head: 104},
        {id:116, text:"๕.๑ หน่วยงานมีการพัฒนาและดำเนินการประเมินผลระหว่างการปฏิบัติงาน และหรือการประเมินผลเป็นรายครั้งตามที่กำหนด เพื่อให้เกิดความมั่นใจว่าได้มีการปฏิบัติตามองค์ประกอบของการควบคุมภายใน", id_head: 105},
        {id:117, text:"๕.๒ หน่วยงานมีการประเมินผลและสื่อสารข้อบกพร่องหรือจุดอ่อนของการควบคุมภายในอย่างทันเวลาต่อฝ่ายบริหารหรือผู้บังคับบัญชา เพื่อให้ผู้รับผิดชอบสามารถแก้ไขได้อย่างเหมาะสม", id_head: 105},
    ]
    if (val === 'maintext') {
        return maintext;
    } else if (val === 'subtext') {
        return subtext;
    } else {
        return null;
    }
}
